places = [{"placeName":"Melrose, Florida","description":"My hometown.","website":"Link: http://melrosefl.com/","latitude":29.709621,"longitude":-82.044055},
{"placeName":"Melrose Volunteer Fire Department","description":"Founded to serve the citizens of Melrose and the surrounding community, the Melrose Volunteer Fire Department serves the surrounding four counties: Alachua, Putnam, Clay, and Bradford.","website":"Link: https://www.facebook.com/melrosevfd24","latitude":29.710066,"longitude":-82.049588},
{"placeName":"Chiappini's","description":"A relic from the past, Chiappini's is a gas station and convenience store like no other. It was opened in 1935, and today continues to serve as a small-town gathering place.","website":"Link: https://www.facebook.com/chiappinis.melrose","latitude":29.709842,"longitude":-82.044363},
{"placeName":"Williamson's Food Store","description":"Williamson's Food Store was opened in 1972, and continues to serve as the main grocery store for Melrose residents today. It is a small store that is both family-owned and operated.","website":"Link: http://williamsonsfoodstore.com/","latitude":29.710252,"longitude":-82.043526},
{"placeName":"Melrose Elementary School","description":"Melrose Elementary School is the elementary school that children who live in the section of Melrose that is in Putnam County attend. It was originally opened as a K-12 school, but adapted with the community and is now a PreK-5 school.","website":"Link: http://putnammes.ss7.sharpschool.com/","latitude":29.709125,"longitude":-82.042602},
{"placeName":"Melrose Public Library","description":"Completed in 1984, the Melrose Public Library was built as a community effort by the citizens of Melrose. It is one of only five libraries in Putnam County.","website":"Link: http://melroselibraryassociation.org/","latitude":29.712488,"longitude":-82.045675},
{"placeName":"Melrose Senior Community Center","description":"One of the newest additions to the town of Melrose, the Melrose Senior Community Center was opened in 2011 as a location for seniors and the elderly in the community to meet together. The center offers many things to the community, including coffee, ice cream, workshops, events, benefits screenings, and educational opportunities.","website":"Link: http://iwionline.org/portfolio/the-melrose-senior-community-center/","latitude":29.70935,"longitude":-82.047204},
{"placeName":"Artisan's Way","description":"Artisan's Way, one of many art galleries in Melrose, was founded to make the arts accessible to the community. It is run completely by volunteers and serves as a place for artists of all disciplines to come together.","website":"Link: http://artisansway.org/","latitude":29.710017,"longitude":-82.051366},
{"placeName":"Melrose Youth Sports Association","description":"The Melrose Youth Sports Association (MYSA) is a non-profit organization in Melrose that allows children in the surrounding community a chance to play recreational sports. The sports offered include softball, baseball, basketball, soccer, t-ball, and flag football.","website":"Link: http://www.melroseyouthsports.com/","latitude":29.708507,"longitude":-82.040109},
{"placeName":"Gallery 26","description":"Gallery 26, another of the art galleries located in Melrose, exists to give members of the community a venue to create and exhibit works of art, in addition to meeting in a friendly and inspiring atmosphere.","website":"Link: http://gallery26melrose.com/home.html","latitude":29.70912,"longitude":-82.047747},
{"placeName":"Melrose Landing Airport","description":"A little-known secret, the Melrose Landing Airport is a privately owned landing strip for community members only. It is located in a private community (Melrose Landing), where airport lots have direct access to the airstrip—pilots who live in those lots can land and taxi straight to their own front door. ","website":"Link: http://www.melroselanding.org/","latitude":29.661636,"longitude":-81.957545},
{"placeName":"Melrose Dream Center","description":"The Melrose Dream Center is a Christian Youth Center dedicated to improving the lives of the youth that live in the surrounding community. Located on the same property as Gallery 26 and various other businesses, it is one of the only youth-oriented services in the area.","website":"Link: http://www.melrosedreamcenter.org/","latitude":29.709193,"longitude":-82.047688},
{"placeName":"Melrose Bay Art Gallery","description":"The Melrose Bay Art Gallery exhibits the work of many of the more popular artists in the area surrounding Melrose. Exhibitions at this gallery are featured for around six weeks at a time. ","website":"Link: http://melrosebayartgallery.com/home.html","latitude":29.709461,"longitude":-82.049776},
{"placeName":"Trinity Episcopal Church","description":"One of the oldest churches in the area, Trinity Episcopal Church was founded in 1881. It has gained much of its reputation as a big pillar in the community because of the multitude of events that are hosted there, including the local Boy Scouts and Cub Scouts troops and the Santa Fe Audubon Society.","website":"Link: http://www.trinitymelrosefl.org/","latitude":29.70984,"longitude":-82.048896},
{"placeName":"Melrose Cemetery","description":"Also known as Eliam Cemetery, the Melrose Cemetery is the largest cemetery in the surrounding community. On Memorial Day in 2007, a Veteran's Memorial was created to recognize the veterans who are laid to rest there. At the time, the cemetery housed a total of 347 veterans from the Civil War, the Spanish-American War, World Wars I and II and the Korean War.","website":"Link: http://eliambaptist.org/cemetery","latitude":29.706358,"longitude":-82.045131},
{"placeName":"Blue Water Bay","description":"A local favorite that is famous in more than just the local area, Blue Water bay is the most upscale dining experience in Melrose. ","website":"Link: http://thebluewaterbay.com/","latitude":29.709498,"longitude":-82.045701},
{"placeName":"Eliam Baptist Church","description":"Founded in 1859, Eliam Baptist Church is one of the oldest churches in the community. It was originally located at Melrose Cemetery (formerly known as Eliam Cemetery), but has been relocated twice after the church burned down at both the original location and the second location on Wynwood Avenue. ","website":"Link: http://www.eliambaptist.org/","latitude":29.710716,"longitude":-82.050642},
{"placeName":"Melrose Bay Park","description":"Another little-known Melrose community secret, Melrose Bay Park is a small, quiet park located on the shore of Melrose Bay (which is a subset of Santa Fe Lake). The park offers sandy shores, picnic tables, and quiet seclusion for both families and individuals to enjoy the beautiful nature offered on the gorgeous lake. ","website":"http://melrosefl.com/About.html#MBPark","latitude":29.712884,"longitude":-82.053014},
{"placeName":"Gainesville Eye Physicians","description":"An extremely well kept secret is that Gainesville Eye Physicians shares the business' building with a historically accurate and preserved general store. The general store is not open to the public, and can in fact only be accessed on special occasions. ","website":"Link: http://www.gainesvilleeyedocs.com/","latitude":29.709459,"longitude":-82.049619},
{"placeName":"Lake Area Animal Hospital","description":"The Lake Area Animal Hospital provides coverage for both small and large animals, as well as grooming and boarding services. Health procedures that the hospital performs includes blood transfusions, dental care, X-rays, microchipping, vaccinations, specialized surgeries, and hospice/euthanasia services. ","website":"Link: http://www.lakeareavets.com/","latitude":29.723662,"longitude":-82.046789},
{"placeName":"Fryer's Chicken","description":"A favorite for locals in and around the Melrose area, Fryer's Chicken is a fast-food style restaurant that serves almost exclusively fried chicken in a variety of forms. The diner-like experience is popular among new and long-time visitors alike.","website":"Link: http://www.fryerschicken.com/","latitude":29.709486,"longitude":-82.045046},
{"placeName":"Betty's Pizza","description":"Established in 1987, Betty's Pizza is the hometown Italian food. The food is all handmade using fresh ingredients, and the menu includes a few local favorites, like the unique and unusual pizza selections. ","website":"Link: http://www.bettys-pizza.com/","latitude":29.712117,"longitude":-82.044552},
{"placeName":"Melrose Cafe","description":"The only non-chain local restaurant that serves breakfast, the Melrose Cafe is a must-visit. The cafe serves both breakfast and lunch, and has been a major feature in the community for 30 years.","website":"Link: http://www.melrosecafefl.com/","latitude":29.716804,"longitude":-82.044452},
{"placeName":"Gator Bait Sports Bar and Grill","description":"A newcomer to the Melrose restaurant scene, Gator Bait Sports Bar and Grill (","website":"Link: https://www.facebook.com/Gator-Bait-Sports-Bar-and-Grill-419826154716765/","latitude":29.70994,"longitude":-82.047368}]
